
	   
#Область ПрограммныйИнтерфейс
		 
Функция ОтправитьЗапрос(РезультатЗаписи = Неопределено, Метод, МетодВыполнения) Экспорт
	
	// 2026.06.04 [Task-1]
	
	АдресСервера = "192.168.68.103";
	Логин = "Администратор";
	Пароль = "";
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");

	HTTP_Запрос = Новый HTTPЗапрос(Метод, Заголовки);
	

    HTTP_Запрос.УстановитьТелоИзСтроки(РезультатЗаписи, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);

	Соединение = Новый HTTPСоединение(АдресСервера,, Логин, Пароль,,,);
	
	Если МетодВыполнения = "POST" тогда
		Ответ 		 = Соединение.ОтправитьДляОбработки(HTTP_Запрос);
	ИначеЕсли МетодВыполнения = "GET" тогда
		Ответ 		 = Соединение.Получить(HTTP_Запрос);
	ИначеЕсли МетодВыполнения = "PUT" тогда	
		Ответ 		 = Соединение.Записать(HTTP_Запрос);
	КонецЕсли;
		
	КодСостояния = Ответ.КодСостояния;
	СтрокаОтвета = Ответ.ПолучитьТелоКакСтроку();
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("КодСостояния", КодСостояния);
	СтруктураОтвета.Вставить("СтрокаОтвета", СтрокаОтвета);
	
	Возврат СтруктураОтвета;
КонецФункции

#КонецОбласти

