	 
	 
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// 2026.06.04 [Task-1]
	
	ПодключитьОбработчикОжидания("ОбновитьДанныеОчереди", 10, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// 2026.06.04 [Task-1]
	
	ОтключитьОбработчикОжидания("ОбновитьДанныеОчереди");
	ОтключитьОбработчикОжидания("ОбновитьОчередь");	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьДанныеОчереди()
	
	// 2026.06.04 [Task-1]
	
	ОбновитьТабличныйДокументОчередиСервер();
		
КонецПроцедуры	

&НаСервере 
Процедура ОбновитьТабличныйДокументОчередиСервер()
	
	// 2026.06.04 [Task-1]
	
	ТабДокОчередь = Новый ТабличныйДокумент;
	ТабДокОчередь.АвтоМасштаб = Истина;
	
	Макет = ПолучитьОбщийМакет("МакетЭлектроннаяОчередь");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка"); 
	ТабДокОчередь.Вывести(ОбластьШапка);
	
	Настройка = Константы.new_ИдентификаторыРабочихМест.Получить();
	СписокРабочихМест = Настройка.Получить();
	
	Если СписокРабочихМест = Неопределено Тогда
		Возврат;
	Иначе
		Если СписокРабочихМест.Количество() = 0 Тогда
			Возврат;	
		Иначе
		
		КонецЕсли;
	КонецЕсли;
	
	МассРабочиеМеста = Новый Массив;
	
	Для Каждого СтрРабочееМесто Из СписокРабочихМест Цикл
		МассРабочиеМеста.Добавить(СтрРабочееМесто.РабочееМесто);	
	КонецЦикла;	
	
	КорневойЭлемент = Новый Структура;
	КорневойЭлемент.Вставить("Jobs", МассРабочиеМеста); 
	
	ЗаписьJSON = Новый ЗаписьJSON;
	
    тПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);  
    ЗаписьJSON.УстановитьСтроку(тПараметрыJSON);
    ЗаписатьJSON(ЗаписьJSON, КорневойЭлемент);
    РезультатЗаписи = ЗаписьJSON.Закрыть();
	
	Метод = "/DemoUP_Server/hs/Ochered/GetListOfOrders";
	
	ОтветСервера = new_ЭлектроннаяОчередьСервер.ОтправитьЗапрос(РезультатЗаписи, Метод, "GET"); 
	
	ЧтениеJSON 		 = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(ОтветСервера.СтрокаОтвета);
	ДанныеОтвета = ПрочитатьJSON(ЧтениеJSON,Ложь);
	ЧтениеJSON.Закрыть();
	
    КВыдаче = ДанныеОтвета.ForIssue;
	Ожидающие = ДанныеОтвета.Waiting;
	
	Для Каждого СтрКВыдаче Из КВыдаче Цикл
		ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаОчередь"); 	
		ОбластьСтрока.Параметры.Заказ = СтрКВыдаче.Order;
		ОбластьСтрока.Параметры.Талон = СтрКВыдаче.Ticket;
		ОбластьСтрока.Параметры.Окно  = СтрКВыдаче.WindowNumber;
		ОбластьСтрока.Параметры.Статус = "Готов к выдаче";
		
		ТабДокОчередь.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	Для Каждого СтрОжидающие Из Ожидающие Цикл
		ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаОчередь"); 	
		ОбластьСтрока.Параметры.Заказ = СтрОжидающие.Order;
		ОбластьСтрока.Параметры.Талон = СтрОжидающие.Ticket;
		ОбластьСтрока.Параметры.Окно  = СтрОжидающие.WindowNumber;
		ОбластьСтрока.Параметры.Статус = "Ожидание";
		
		ТабДокОчередь.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	ЭтаФорма.ЭлектроннаяОчередь = ТабДокОчередь;
	
КонецПроцедуры

#КонецОбласти