
Функция ПолучитьСписокЗаказовGET_ПолучитьСписок(Запрос)
	
	// 2026.06.04 [Task-1]
	
	ДанныеСтрока = Запрос.ПолучитьТелоКакСтроку();
	
	ПараметрыОтвета = Новый Структура;
	
	ТекстОшибки = "";
	
	Попытка
		new_ЭлектроннаяОчередьСервер.ПолучитьДанныеЭлектроннойОчереди(ДанныеСтрока, ПараметрыОтвета, ТекстОшибки);
	Исключение
		ОписаниеОшибки 	= ОписаниеОшибки();
		Ответ 			= Новый HTTPСервисОтвет(500, ОписаниеОшибки);
		Возврат Ответ;
	КонецПопытки; 
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON());
    ЗаписатьJSON(ЗаписьJSON, ПараметрыОтвета);
	
	ОтветJSON = ЗаписьJSON.Закрыть();
	
	КодОтвета = ПараметрыОтвета.status_code;
	КодОтвета = Число(КодОтвета);
	
	Если ТекстОшибки <> "" Тогда
		Ответ = Новый HTTPСервисОтвет(КодОтвета, ТекстОшибки);	
	Иначе
		Ответ = Новый HTTPСервисОтвет(КодОтвета);	
	КонецЕсли;	
	
	Ответ.Заголовки.Вставить("Content-type", "application/JSON; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(ОтветJSON, КодировкаТекста.UTF8);
	
	Возврат Ответ;
КонецФункции
