
#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт

    ЮТТесты
        .ДобавитьТестовыйНабор("Добавление заказа в электронную очередь")
            .ДобавитьТест("Тест_ДобавлениеЗаказаВОчередь")
            
		.ДобавитьТестовыйНабор("Изменение статуса заказа в АРМ")
		    .ДобавитьТест("Тест_ИзменениеСтатусаЭлектроннойОчереди")
			
		.ДобавитьТестовыйНабор("Изменение статуса в документе Заказ")
		    .ДобавитьТест("Тест_ИзменениеСтатусаЗаказа")
			
        .ДобавитьТестовыйНабор("HTTP запрос от мобильного устройства")
            .ДобавитьТест("Тест_ПолучитьСписокЗаказовGET_ПолучитьСписок")
			
КонецПроцедуры

Процедура Тест_ДобавлениеЗаказаВОчередь() Экспорт

	// Подготовка тестовых данных
    КодОрганизация = "000000003";
	СсылкаОрганизация = ЮТест.Данные().СсылкаПоРеквизиту("Справочник.Организации", "Код", КодОрганизация);
	
	КодКонтрагент = "000000014";
	СсылкаКонтрагент = ЮТест.Данные().СсылкаПоРеквизиту("Справочник.Контрагенты", "Код", КодКонтрагент);
	
	КодСклад = "000000001";
	СсылкаСклад = ЮТест.Данные().СсылкаПоРеквизиту("Справочник.Склады", "Код", КодСклад);
	    
	КодВидЦен = "000000003";
	СсылкаВидЦен = ЮТест.Данные().СсылкаПоРеквизиту("Справочник.ВидыЦен", "Код", КодВидЦен);

	Наименование = "Bosch1234";
	СсылкаТовар = ЮТест.Данные().СсылкаПоРеквизиту("Справочник.Товары", "наименование", Наименование);
	
	Цена = 3500;
	Сумма = 3500;
	Количество = 1;
	
	ДокументЗаказ = ЮТест.Данные().КонструкторОбъекта("Документ.Заказ")
	.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля
	.Установить("Дата", ТекущаяДатаСеанса())
	.Установить("Покупатель", СсылкаКонтрагент) 
	.Установить("Склад", СсылкаСклад) 
	.Установить("ВидЦен", СсылкаВидЦен) 
	.Установить("Организация", СсылкаОрганизация) 
	.Установить("СостояниеЗаказа", Перечисления.СостоянияЗаказов.Открыт)  
	.Установить("Автор", Справочники.Пользователи.НайтиПоНаименованию("Администратор", Истина)) 
	.Установить("Сумма", Сумма)
		.ТабличнаяЧасть("Товары")
			.ДобавитьСтроку()
				.Установить("Товар", Справочники.Товары.НайтиПоНаименованию("Bosch1234", Истина)) 
				.Установить("Цена", Цена) 
				.Установить("Количество", 1) 
				.Установить("Сумма", Сумма)
	.Провести() // Проводим документ и возвращаем ссылку
	;

	// Перевод в статус "В работе"
	ДокументОбъект = ДокументЗаказ.ПолучитьОбъект();
	ДокументОбъект.СостояниеЗаказа = Перечисления.СостоянияЗаказов.ВРаботе;
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.new_ЭлектроннаяОчередь")
	.СодержитЗаписи(ЮТест.Предикат() 
	.Реквизит("Заказ").Равно(ДокументЗаказ));
	
КонецПроцедуры

Процедура Тест_ИзменениеСтатусаЭлектроннойОчереди() Экспорт
    
	// Подготовка тестовых данных
    КодОрганизация = "000000003";
	СсылкаОрганизация = ЮТест.Данные().СсылкаПоРеквизиту("Справочник.Организации", "Код", КодОрганизация);
	
	КодКонтрагент = "000000014";
	СсылкаКонтрагент = ЮТест.Данные().СсылкаПоРеквизиту("Справочник.Контрагенты", "Код", КодКонтрагент);
	
	КодСклад = "000000001";
	СсылкаСклад = ЮТест.Данные().СсылкаПоРеквизиту("Справочник.Склады", "Код", КодСклад);
	    
	КодВидЦен = "000000003";
	СсылкаВидЦен = ЮТест.Данные().СсылкаПоРеквизиту("Справочник.ВидыЦен", "Код", КодВидЦен);

	Наименование = "Bosch1234";
	СсылкаТовар = ЮТест.Данные().СсылкаПоРеквизиту("Справочник.Товары", "наименование", Наименование);

	Цена = 3500;
	Сумма = 3500;
	Количество = 1;
	
	ТекстОшибки = "";
	
	ДокументЗаказ = ЮТест.Данные().КонструкторОбъекта("Документ.Заказ")
	.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля
	.Установить("Дата", ТекущаяДатаСеанса())
	.Установить("Покупатель", СсылкаКонтрагент) 
	.Установить("Склад", СсылкаСклад) 
	.Установить("ВидЦен", СсылкаВидЦен) 
	.Установить("Организация", СсылкаОрганизация) 
	.Установить("СостояниеЗаказа", Перечисления.СостоянияЗаказов.Открыт)  
	.Установить("Автор", Справочники.Пользователи.НайтиПоНаименованию("Администратор", Истина)) 
	.Установить("Сумма", Сумма)
		.ТабличнаяЧасть("Товары")
			.ДобавитьСтроку()
				.Установить("Товар", Справочники.Товары.НайтиПоНаименованию("Bosch1234", Истина)) 
				.Установить("Цена", Цена) 
				.Установить("Количество", 1) 
				.Установить("Сумма", Сумма)
	.Провести() // Проводим документ и возвращаем ссылку
	;
	
	// Перевод в статус "В работе"
	ДокументОбъект = ДокументЗаказ.ПолучитьОбъект();
	ДокументОбъект.СостояниеЗаказа = Перечисления.СостоянияЗаказов.ВРаботе;
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	РабочееМесто = ЮТест.Данные().КонструкторОбъекта("Справочник.new_РабочиеМестаЭлектроннойОчереди")
	.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля
	.Установить("Склад", СсылкаСклад) 
	.Установить("НомерОкна", 1) 
		.ТабличнаяЧасть("Операторы")
			.ДобавитьСтроку()
				.Установить("Пользователь", Справочники.Пользователи.НайтиПоНаименованию("Администратор", Истина)) 
	.Записать() // Проводим документ и возвращаем ссылку
	;
	
	УстановитьСтатусСервер(Перечисления.new_СтатусыЭлектроннойОчереди.ВСборке, ДокументЗаказ, ТекстОшибки, СсылкаСклад, РабочееМесто);
	
	Менеджер = РегистрыСведений.new_ЭлектроннаяОчередь.СоздатьМенеджерЗаписи();
    Менеджер.Заказ = ДокументЗаказ;
	Менеджер.Склад = СсылкаСклад;
	
	Менеджер.Прочитать();
	
	ЮТест.ОжидаетЧто(Менеджер)
	  .Свойство("Статус").Равно(Перечисления.new_СтатусыЭлектроннойОчереди.ВСборке)
	  ;  
	
	ЮТест.ОжидаетЧто(ДокументЗаказ)
	  .Свойство("СостояниеЗаказа").Равно(Перечисления.СостоянияЗаказов.ВРаботе)
	  ;   
	  
	УстановитьСтатусСервер(Перечисления.new_СтатусыЭлектроннойОчереди.ГотовКВыдаче, ДокументЗаказ, ТекстОшибки, СсылкаСклад, РабочееМесто);
	
	Менеджер = РегистрыСведений.new_ЭлектроннаяОчередь.СоздатьМенеджерЗаписи();
    Менеджер.Заказ = ДокументЗаказ;
	Менеджер.Склад = СсылкаСклад;
	
	Менеджер.Прочитать();
	
	ЮТест.ОжидаетЧто(Менеджер)
	  .Свойство("Статус").Равно(Перечисления.new_СтатусыЭлектроннойОчереди.ГотовКВыдаче)
	  ;  
	
	УстановитьСтатусСервер(Перечисления.new_СтатусыЭлектроннойОчереди.Завершен, ДокументЗаказ, ТекстОшибки, СсылкаСклад, РабочееМесто);
	
	Менеджер = РегистрыСведений.new_ЭлектроннаяОчередь.СоздатьМенеджерЗаписи();
    Менеджер.Заказ = ДокументЗаказ;
	Менеджер.Склад = СсылкаСклад;
	
	Менеджер.Прочитать();
	
	ЮТест.ОжидаетЧто(Менеджер)
	  .Свойство("Статус").Равно(Перечисления.new_СтатусыЭлектроннойОчереди.Завершен)
	  ;  
	
	УстановитьСтатусСервер(Перечисления.new_СтатусыЭлектроннойОчереди.Отменен, ДокументЗаказ, ТекстОшибки, СсылкаСклад, РабочееМесто);
	
	Менеджер = РегистрыСведений.new_ЭлектроннаяОчередь.СоздатьМенеджерЗаписи();
    Менеджер.Заказ = ДокументЗаказ;
	Менеджер.Склад = СсылкаСклад;
	
	Менеджер.Прочитать();
	
	ЮТест.ОжидаетЧто(Менеджер)
	  .Свойство("Статус").Равно(Перечисления.new_СтатусыЭлектроннойОчереди.Отменен)
	  ;  
	
КонецПроцедуры

Процедура Тест_ИзменениеСтатусаЗаказа() Экспорт
	
	// Подготовка тестовых данных
    КодОрганизация = "000000003";
	СсылкаОрганизация = ЮТест.Данные().СсылкаПоРеквизиту("Справочник.Организации", "Код", КодОрганизация);
	
	КодКонтрагент = "000000014";
	СсылкаКонтрагент = ЮТест.Данные().СсылкаПоРеквизиту("Справочник.Контрагенты", "Код", КодКонтрагент);
	
	КодСклад = "000000001";
	СсылкаСклад = ЮТест.Данные().СсылкаПоРеквизиту("Справочник.Склады", "Код", КодСклад);
	    
	КодВидЦен = "000000003";
	СсылкаВидЦен = ЮТест.Данные().СсылкаПоРеквизиту("Справочник.ВидыЦен", "Код", КодВидЦен);

	Наименование = "Bosch1234";
	СсылкаТовар = ЮТест.Данные().СсылкаПоРеквизиту("Справочник.Товары", "наименование", Наименование);

	Цена = 3500;
	Сумма = 3500;
	Количество = 1;
	
	ДокументЗаказ = ЮТест.Данные().КонструкторОбъекта("Документ.Заказ")
	.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля
	.Установить("Дата", ТекущаяДатаСеанса())
	.Установить("Покупатель", СсылкаКонтрагент) 
	.Установить("Склад", СсылкаСклад) 
	.Установить("ВидЦен", СсылкаВидЦен) 
	.Установить("Организация", СсылкаОрганизация) 
	.Установить("СостояниеЗаказа", Перечисления.СостоянияЗаказов.Открыт)  
	.Установить("Автор", Справочники.Пользователи.НайтиПоНаименованию("Администратор", Истина)) 
	.Установить("Сумма", Сумма)
		.ТабличнаяЧасть("Товары")
			.ДобавитьСтроку()
				.Установить("Товар", Справочники.Товары.НайтиПоНаименованию("Bosch1234", Истина)) 
				.Установить("Цена", Цена) 
				.Установить("Количество", 1) 
				.Установить("Сумма", Сумма)
	.Провести() // Проводим документ и возвращаем ссылку
	;
	
    СтатусЗаказа = Перечисления.СостоянияЗаказов.ВРаботе;
	
	УстрановитьСтатусЗаказаСервер(ДокументЗаказ, СтатусЗаказа);
	
	ЮТест.ОжидаетЧто(ДокументЗаказ)
	  .Свойство("СостояниеЗаказа").Равно(СтатусЗаказа)
	  ;  

	СтатусЗаказа = Перечисления.СостоянияЗаказов.Выполнен;
	
	УстрановитьСтатусЗаказаСервер(ДокументЗаказ, СтатусЗаказа);
	
	ЮТест.ОжидаетЧто(ДокументЗаказ)
	  .Свойство("СостояниеЗаказа").Равно(СтатусЗаказа)
	  ;  
	  
	СтатусЗаказа = Перечисления.СостоянияЗаказов.Закрыт;
	
	УстрановитьСтатусЗаказаСервер(ДокументЗаказ, СтатусЗаказа);
	
	ЮТест.ОжидаетЧто(ДокументЗаказ)
	  .Свойство("СостояниеЗаказа").Равно(СтатусЗаказа)
	  ;    
	  
КонецПроцедуры

Процедура Тест_ПолучитьСписокЗаказовGET_ПолучитьСписок() Экспорт
	
	// Подготовка тестовых данных
    КодОрганизация = "000000003";
	СсылкаОрганизация = ЮТест.Данные().СсылкаПоРеквизиту("Справочник.Организации", "Код", КодОрганизация);
	
	КодКонтрагент = "000000014";
	СсылкаКонтрагент = ЮТест.Данные().СсылкаПоРеквизиту("Справочник.Контрагенты", "Код", КодКонтрагент);
	
	КодСклад = "000000001";
	СсылкаСклад = ЮТест.Данные().СсылкаПоРеквизиту("Справочник.Склады", "Код", КодСклад);
	    
	КодВидЦен = "000000003";
	СсылкаВидЦен = ЮТест.Данные().СсылкаПоРеквизиту("Справочник.ВидыЦен", "Код", КодВидЦен);

	Наименование = "Bosch1234";
	СсылкаТовар = ЮТест.Данные().СсылкаПоРеквизиту("Справочник.Товары", "наименование", Наименование);

	Цена = 3500;
	Сумма = 3500;
	Количество = 1;
	
	ТекстОшибки = "";
	
	ДокументЗаказ = ЮТест.Данные().КонструкторОбъекта("Документ.Заказ")
	.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля
	.Установить("Дата", ТекущаяДатаСеанса())
	.Установить("Покупатель", СсылкаКонтрагент) 
	.Установить("Склад", СсылкаСклад) 
	.Установить("ВидЦен", СсылкаВидЦен) 
	.Установить("Организация", СсылкаОрганизация) 
	.Установить("СостояниеЗаказа", Перечисления.СостоянияЗаказов.Открыт)  
	.Установить("Автор", Справочники.Пользователи.НайтиПоНаименованию("Администратор", Истина)) 
	.Установить("Сумма", Сумма)
		.ТабличнаяЧасть("Товары")
			.ДобавитьСтроку()
				.Установить("Товар", Справочники.Товары.НайтиПоНаименованию("Bosch1234", Истина)) 
				.Установить("Цена", Цена) 
				.Установить("Количество", 1) 
				.Установить("Сумма", Сумма)
	.Провести() // Проводим документ и возвращаем ссылку
	;
	
	// Перевод в статус "В работе"
	ДокументОбъект = ДокументЗаказ.ПолучитьОбъект();
	ДокументОбъект.СостояниеЗаказа = Перечисления.СостоянияЗаказов.ВРаботе;
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	РабочееМесто = ЮТест.Данные().КонструкторОбъекта("Справочник.new_РабочиеМестаЭлектроннойОчереди")
	.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля
	.Установить("Склад", СсылкаСклад) 
	.Установить("НомерОкна", 1)
	.Установить("ИдентификаторРабочегоМеста", "5555")
		.ТабличнаяЧасть("Операторы")
			.ДобавитьСтроку()
				.Установить("Пользователь", Справочники.Пользователи.НайтиПоНаименованию("Администратор", Истина)) 
	.Записать() // Проводим документ и возвращаем ссылку
	;

	УстановитьСтатусСервер(Перечисления.new_СтатусыЭлектроннойОчереди.ВСборке, ДокументЗаказ, ТекстОшибки, СсылкаСклад, РабочееМесто);
	УстановитьСтатусСервер(Перечисления.new_СтатусыЭлектроннойОчереди.ГотовКВыдаче, ДокументЗаказ, ТекстОшибки, СсылкаСклад, РабочееМесто);

	ДокументЗаказ = ЮТест.Данные().КонструкторОбъекта("Документ.Заказ")
	.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля
	.Установить("Дата", ТекущаяДатаСеанса())
	.Установить("Покупатель", СсылкаКонтрагент) 
	.Установить("Склад", СсылкаСклад) 
	.Установить("ВидЦен", СсылкаВидЦен) 
	.Установить("Организация", СсылкаОрганизация) 
	.Установить("СостояниеЗаказа", Перечисления.СостоянияЗаказов.Открыт)  
	.Установить("Автор", Справочники.Пользователи.НайтиПоНаименованию("Администратор", Истина)) 
	.Установить("Сумма", Сумма)
		.ТабличнаяЧасть("Товары")
			.ДобавитьСтроку()
				.Установить("Товар", Справочники.Товары.НайтиПоНаименованию("Bosch1234", Истина)) 
				.Установить("Цена", Цена) 
				.Установить("Количество", 1) 
				.Установить("Сумма", Сумма)
	.Провести() // Проводим документ и возвращаем ссылку
	;
	 
	// Перевод в статус "В работе"
	ДокументОбъект = ДокументЗаказ.ПолучитьОбъект();
	ДокументОбъект.СостояниеЗаказа = Перечисления.СостоянияЗаказов.ВРаботе;
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	УстановитьСтатусСервер(Перечисления.new_СтатусыЭлектроннойОчереди.ВСборке, ДокументЗаказ, ТекстОшибки, СсылкаСклад, РабочееМесто);
	
    МассРабочиеМеста = Новый Массив;
	МассРабочиеМеста.Добавить("5555");
	
	КорневойЭлемент = Новый Структура;
	КорневойЭлемент.Вставить("Jobs", МассРабочиеМеста); 
	
	ЗаписьJSON = Новый ЗаписьJSON;
	
    тПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);  
    ЗаписьJSON.УстановитьСтроку(тПараметрыJSON);
    ЗаписатьJSON(ЗаписьJSON, КорневойЭлемент);
    РезультатЗаписи = ЗаписьJSON.Закрыть();
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	
	Метод = "/DemoUP_Server/hs/Ochered/GetListOfOrders";
	
	HTTP_Запрос = Новый HTTPЗапрос(Метод, Заголовки);
    HTTP_Запрос.УстановитьТелоИзСтроки(РезультатЗаписи, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);

	Ответ = ПолучитьСписокЗаказовGET_ПолучитьСписок(HTTP_Запрос);
	СтрокаОтвета = Ответ.ПолучитьТелоКакСтроку();

	ЧтениеJSON 		 = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(СтрокаОтвета);
	ДанныеОтвета = ПрочитатьJSON(ЧтениеJSON,Ложь);
	ЧтениеJSON.Закрыть();
	
    КВыдаче = ДанныеОтвета.ForIssue;
	Ожидающие = ДанныеОтвета.Waiting;

	 ЮТест.ОжидаетЧто(КВыдаче.Количество())
    	.Больше(0);
	  
	 ЮТест.ОжидаетЧто(Ожидающие.Количество())
    	.Больше(0);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСписокЗаказовGET_ПолучитьСписок(Запрос)
	
	ДанныеСтрока = Запрос.ПолучитьТелоКакСтроку();
	
	ПараметрыОтвета = Новый Структура;
	
	ТекстОшибки = "";
	
	Попытка
		new_ЭлектроннаяОчередьСервер.ПолучитьДанныеЭлектроннойОчереди(ДанныеСтрока, ПараметрыОтвета, ТекстОшибки);
	Исключение
		ОписаниеОшибки 	= ОписаниеОшибки();
		Ответ 			= Новый HTTPСервисОтвет(500, ОписаниеОшибки);
		Возврат Ответ;
	КонецПопытки; 
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON());
    ЗаписатьJSON(ЗаписьJSON, ПараметрыОтвета);
	
	ОтветJSON = ЗаписьJSON.Закрыть();
	
	КодОтвета = ПараметрыОтвета.status_code;
	КодОтвета = Число(КодОтвета);
	
	Если ТекстОшибки <> "" Тогда
		Ответ = Новый HTTPСервисОтвет(КодОтвета, ТекстОшибки);	
	Иначе
		Ответ = Новый HTTPСервисОтвет(КодОтвета);	
	КонецЕсли;	
	
	Ответ.Заголовки.Вставить("Content-type", "application/JSON; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(ОтветJSON, КодировкаТекста.UTF8);
	
	Возврат Ответ;
КонецФункции

Процедура УстрановитьСтатусЗаказаСервер(Заказ, СтатусЗаказа)
	
	ЗаказОбъект = Заказ.ПолучитьОбъект();
	
	Если СтатусЗаказа = Перечисления.СостоянияЗаказов.ПустаяСсылка() Тогда
		ЗаказОбъект.УстановитьПометкуУдаления(Истина);
	Иначе
		ЗаказОбъект.СостояниеЗаказа = СтатусЗаказа;
		ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьСтатусСервер(СтатусОчереди, Заказ, ТекстОшибки, Склад, РабочееМесто)
	
	// 2026.06.04 [Task-1]
	
	СтрОчередь = Новый Структура;
	СтрОчередь.Вставить("РабочееМесто", Неопределено);
	СтрОчередь.Вставить("Заказ", 		Неопределено);
	СтрОчередь.Вставить("Статус", 		Неопределено);
	СтрОчередь.Вставить("НомерТалона",  Неопределено);
	
	НомерТалонаМаксимум = 0;
	Склад = Склад;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	new_ЭлектроннаяОчередь.РабочееМесто КАК РабочееМесто,
		|	new_ЭлектроннаяОчередь.Заказ КАК Заказ,
		|	new_ЭлектроннаяОчередь.Статус КАК Статус,
		|	new_ЭлектроннаяОчередь.НомерТалона КАК НомерТалона,
		|	new_ЭлектроннаяОчередь.Склад КАК Склад
		|ИЗ
		|	РегистрСведений.new_ЭлектроннаяОчередь КАК new_ЭлектроннаяОчередь
		|ГДЕ
		|	new_ЭлектроннаяОчередь.Заказ = &Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(new_ЭлектроннаяОчередь.НомерТалона) КАК НомерТалона
		|ИЗ
		|	РегистрСведений.new_ЭлектроннаяОчередь КАК new_ЭлектроннаяОчередь
		|ГДЕ
		|	new_ЭлектроннаяОчередь.Склад = &Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	new_ЭлектроннаяОчередь.Заказ КАК Заказ
		|ИЗ
		|	РегистрСведений.new_ЭлектроннаяОчередь КАК new_ЭлектроннаяОчередь
		|ГДЕ
		|	new_ЭлектроннаяОчередь.Склад = &Склад
		|	И new_ЭлектроннаяОчередь.Статус = ЗНАЧЕНИЕ(Перечисление.new_СтатусыЭлектроннойОчереди.ВСборке)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	new_ЭлектроннаяОчередь.Заказ КАК Заказ
		|ИЗ
		|	РегистрСведений.new_ЭлектроннаяОчередь КАК new_ЭлектроннаяОчередь
		|ГДЕ
		|	new_ЭлектроннаяОчередь.Склад = &Склад
		|	И new_ЭлектроннаяОчередь.Статус = ЗНАЧЕНИЕ(Перечисление.new_СтатусыЭлектроннойОчереди.ГотовКВыдаче)
		|	И new_ЭлектроннаяОчередь.Заказ = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
    Запрос.УстановитьПараметр("Склад", Склад);
	
	Пакеты = Запрос.ВыполнитьПакет(); 
	
	ВыборкаЗаказы = Пакеты[0].Выбрать();
	ВыборкаНомера = Пакеты[1].Выбрать();
	ЗаказыВСборке = Пакеты[2];
	ЗаказыКВыдаче = Пакеты[3];
	
	Пока ВыборкаНомера.Следующий() Цикл
		НомерТалонаМаксимум = ВыборкаНомера.НомерТалона; 
	КонецЦикла;
	
	Пока ВыборкаЗаказы.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтрОчередь, ВыборкаЗаказы); 
	КонецЦикла;
	
	Если СтатусОчереди = Перечисления.new_СтатусыЭлектроннойОчереди.ВСборке Тогда
		Если СтрОчередь.РабочееМесто = Неопределено Или СтрОчередь.РабочееМесто = Справочники.new_РабочиеМестаЭлектроннойОчереди.ПустаяСсылка() Тогда
			Если Не ЗаказыВСборке.Пустой() Тогда
				ТекстОшибки = "Уже существует заказ в статусе ""В сборке"". Закончите его оформление";
				Возврат;
			КонецЕсли;	
			
			Менеджер 			  = РегистрыСведений.new_ЭлектроннаяОчередь.СоздатьМенеджерЗаписи();
			Менеджер.Заказ 		  = Заказ;
			Менеджер.РабочееМесто = РабочееМесто;
			Менеджер.НомерТалона  = НомерТалонаМаксимум + 1;
			Менеджер.Статус 	  = СтатусОчереди;
			Менеджер.Склад        = Склад;
			
			Менеджер.Записать();
		Иначе
			ТекстОшибки = "Заказ отменен или уже находится в сборке";
			Возврат;
		КонецЕсли;
	ИначеЕсли СтатусОчереди = Перечисления.new_СтатусыЭлектроннойОчереди.ГотовКВыдаче Тогда
		
		Если СтрОчередь.РабочееМесто = Неопределено Или СтрОчередь.РабочееМесто = Справочники.new_РабочиеМестаЭлектроннойОчереди.ПустаяСсылка() Тогда
			ТекстОшибки = "Заказ не в сборке. Действие недоступно";
			Возврат;
		Иначе	
			Если СтрОчередь.РабочееМесто <> РабочееМесто Или СтрОчередь.Статус <> Перечисления.new_СтатусыЭлектроннойОчереди.ВСборке Тогда
				ТекстОшибки = "Заказ не в сборке. Действие недоступно";
				Возврат;	
			Иначе	
				Менеджер 			  = РегистрыСведений.new_ЭлектроннаяОчередь.СоздатьМенеджерЗаписи();
				Менеджер.Заказ 		  = Заказ;
				Менеджер.РабочееМесто = РабочееМесто;
				Менеджер.НомерТалона  = СтрОчередь.НомерТалона;
				Менеджер.Статус 	  = СтатусОчереди;
				Менеджер.Склад        = Склад;
				
				Менеджер.Записать();	
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли СтатусОчереди = Перечисления.new_СтатусыЭлектроннойОчереди.Завершен Тогда	
		Если ЗаказыКВыдаче.Пустой() Тогда
			ТекстОшибки = "Заказ еще не выдан. Действие недоступно";
			Возврат;	
		КонецЕсли;	
		
		Менеджер 			  = РегистрыСведений.new_ЭлектроннаяОчередь.СоздатьМенеджерЗаписи();
		Менеджер.Заказ 		  = Заказ;
		Менеджер.РабочееМесто = РабочееМесто;
		Менеджер.НомерТалона  = СтрОчередь.НомерТалона;
		Менеджер.Статус 	  = СтатусОчереди;
		Менеджер.Склад        = Склад;
		
		Менеджер.Записать();
	Иначе
		Менеджер 			  = РегистрыСведений.new_ЭлектроннаяОчередь.СоздатьМенеджерЗаписи();
		Менеджер.Заказ 		  = Заказ;
		Менеджер.РабочееМесто = РабочееМесто;
		Менеджер.НомерТалона  = СтрОчередь.НомерТалона;
		Менеджер.Статус 	  = СтатусОчереди;
		Менеджер.Склад        = Склад;
		
		Менеджер.Записать();	
	КонецЕсли;	
	
КонецПроцедуры 

 
#КонецОбласти
 

