		 
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Настройка = Константы.new_ИдентификаторыРабочихМест.Получить();
	СписокРабочихМест = Настройка.Получить(); 
	
	Если СписокРабочихМест = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаРабочееМесто Из СписокРабочихМест Цикл
		НоваяСтрока = ЭтаФорма.РабочиеМеста.Добавить();
		
		Попытка
			НоваяСтрока.РабочееМесто = СтрокаРабочееМесто.РабочееМесто;
		Исключение
			НоваяСтрока.РабочееМесто = СтрокаРабочееМесто;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
		 
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	СохранитьСписокРабочихМестНаСервере();
	
КонецПроцедуры

 &НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
	СохранитьСписокРабочихМестНаСервере();
    ЭтаФорма.Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьСписокРабочихМестНаСервере()
	
	//СписокМест = Новый Массив;
	//
	//Для Каждого СтрРабочееМесто Из ЭтаФорма.РабочиеМеста Цикл
	//	СписокМест.Добавить(СокрЛП(СтрРабочееМесто.РабочееМесто));	
	//КонецЦикла;
	
	СписокМест = ЭтаФорма.РабочиеМеста.Выгрузить();
	
	ХранилищеНастройки = Новый ХранилищеЗначения(СписокМест);
	Константы.new_ИдентификаторыРабочихМест.Установить(ХранилищеНастройки);
	
КонецПроцедуры	

#КонецОбласти

